app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My Edit"], ["description", "My post description"], ["updated_at", "2017-11-25 11:09:38.257925"], ["id", 1]]
---
	def update
		#binding.pry
	  @post = Post.find(params[:id])
	  @post.update(post_params)